[
  {
    "title": "TwitterReplica",
    "github": "https://github.com/look919/twitterReplica",
    "url": "https://www.youtube.com/watch?v=ZYlMCxW5iRI&t=51s",
    "img": "twitter.png",
    "descriptionPl": "To na razie mój największy projekt. Zawiera główne funkcjonalności Twittera jak tweety, profile i wszystkie akcje z nimi związane.  Apka wciąż jest we wczesnej fazie rozwoju i z tego powodu jeszcze jej nie upubliczniłem, w zamian prezentuję jej stan w filmiku do którego prowadzi link (film może być nieaktualny gdy to czytasz, sprawdź datę publikacji)",
    "descriptionEn": "This is my biggest project so far. It contains the main Twitter functionalities like tweets, profiles and all related actions.  The app is still in the early stages of development and for this reason I haven't published it yet, instead I present its status in a video to which the link leads (the video may be out of date when you read it, check the publication date)",
    "imgHover": ["node.png", "reactredux.png", "css.png", "mongodb.png"],
    "development": true,
    "online": true
  },
  {
    "title": "TomOffice",
    "github": "https://github.com/look919/tomOffice",
    "url": "https://tomoffice.herokuapp.com/",
    "img": "tomOffice.png",
    "descriptionPl": "Sklep sprzedający meble biurowe. Potencjalny klient może zapoznać się z ofertą sklepu, znaleźć interesujący go produkt poprzez filtrowanie, dodawać do koszyka, zamawiać produkty i płacić za nie online.",
    "descriptionEn": "A shop selling office furniture. A prospective customer can view the shop's offer, find the product they are interested in by filtering, add it to their shopping cart, order products and pay for them online.",
    "imgHover": ["node.png", "reactredux.png", "css.png", "mongodb.png"],
    "development": false,
    "online": true
  },
  {
    "title": "ResumeGenerator",
    "github": "https://github.com/look919/resumeGenerator",
    "url": "https://resume-generatoor.herokuapp.com/",
    "img": "resumeGenerator.png",
    "descriptionPl": "Strona stworzona z myślą o tworzeniu CV dla junior web developerów. Stworzyłem ją na własne potrzeby, oto przykład ",
    "descriptionEn": "Website designated to generate resumes for junior web developers. I created this app for my own usage, here's an example of a ",
    "imgHover": ["node.png", "reactredux.png", "css.png", "mongodb.png"],
    "development": false,
    "online": true
  },
  {
    "title": "Hotel Giant",
    "github": "https://github.com/look919/hotelGiant",
    "url": "https://hotelgiant.herokuapp.com/",
    "img": "hotelGiant.png",
    "descriptionPl": "Aplikacja dla hotelu, która zawiera przegląd usług sprzedawanych przez podmiot, rezerawcję pokojów online, panel zarówno dla admina hotelu jak i gości, w którym to mogą kontrolować swoje wydatki.",
    "descriptionEn": "Application for the hotel, which contains an overview of the services sold by the entity, booking rooms online, a panel for both the hotel admin and guests where they can control their expenses.",
    "imgHover": ["node.png", "reactredux.png", "css.png", "mongodb.png"],
    "development": false,
    "online": true
  },
  {
    "title": "ChickyChicken",
    "github": "https://github.com/look919/chickyChicken",
    "url": "https://chickychicken.herokuapp.com",
    "img": "chickychicken.png",
    "descriptionPl": "Restauracja fast foodowa napisana w Reaccie. Posiada informacje o lokalu, pozwala klientom na zamawianie dań z menu, rezerwowanie stolików czy też kontakt z obsługą.",
    "descriptionEn": "React application for fast food restaurant. Provides a brief overview of services sold by the company and enables customers to order food online, reserve table and contact with restaurant.",
    "imgHover": ["node.png", "reactredux.png", "css.png", "firebase.png"],
    "development": false,
    "online": true
  },
  {
    "title": "Portfolio",
    "github": "https://github.com/look919/portfolio",
    "url": "https://tomasz-wirkus-portfolio.herokuapp.com/",
    "img": "portfolio.png",
    "descriptionPl": "Strona, na której się obecenie znajdujesz. To z pewnością nie jest najbardziej zaawansowany z moich projektów, ale zdecydowanie to właśnie na niego poświęciłem najwięcej czasu.",
    "descriptionEn": "The website you are currently on. It's certainly not the most advanced of my projects, but it's definitely the one I spent most of my time on.",
    "imgHover": ["react.png", "css.png"],
    "development": true,
    "online": true
  },
  {
    "title": "C++ Chess game",
    "github": "https://github.com/look919/Chess-game-Qt",
    "url": "https://www.youtube.com/watch?v=oQRxG5nHmoY",
    "img": "chess.png",
    "descriptionPl": "Mój największy niewebowy projekt. Ponieważ napisałem go na początku mojej zabawy z programowaniem jakość kodu pozostawia wiele do życzenia. Sama gra jest w pełni funkcjonalna, zawiera wiązania figur przeciwnika, ruch en passant, podwójny szach i z szach z odkrycia.",
    "descriptionEn": "My biggest non web project. Due to the fact, I coded it at the begginning of my programming journey, the quality of code is not great. Game is fully functional, includes pinning opponent's figures, en passant move, discover and double checks.",
    "imgHover": ["cpp.png", "qt.png"],
    "development": false,
    "online": true
  },
  {
    "title": "xkcd React Native app",
    "github": "https://github.com/look919/xkcdReactNative",
    "url": "https://github.com/look919/xkcdReactNative",
    "img": "xkcd.png",
    "descriptionPl": "Pierwsze spotkanie z React Native i Expo. Aplikacja fetchuje najnowsze komiksy z xkcd.com i na bieżąco renduruje kolejne przy scrollowaniu.",
    "descriptionEn": "First meeting with React Native and Expo. Application fetches the latest comics from xkcd.com and renders the next ones on scrolling.",
    "imgHover": ["react.png", "expo.png"],
    "development": false,
    "online": false
  }
]
